"""
集合（set）是由一个或数个形态各异的大小整体组成的，构成集合的事物或对象称作元素或是成员。

基本功能是进行成员关系测试和删除重复元素。
可以使用大括号 { } 或者 set() 函数创建集合，注意：创建一个空集合必须用 set() 而不是 { }，因为 { } 是用来创建一个空字典。
"""

print('---------------------------------------------------------------------------------------------------------------')
sites = {'Google', 'Taobao', 'WeiXin', 'Facebook', 'Zhihu', 'Baidu', 'WeiXin'}

print(sites)   # 输出集合，重复的元素被自动去掉
"""
{'Zhihu', 'Taobao', 'Google', 'WeiXin', 'Facebook', 'Baidu'}
"""


print('---------------------------------------------------------------------------------------------------------------')
# 成员测试
if 'WeiXin' in sites:
    print('WeiXin 在集合中')
else:
    print('WeiXin 不在集合中')
"""
WeiXin 在集合中
"""


print('---------------------------------------------------------------------------------------------------------------')
# set可以进行集合运算
a = set('Gooooooooooooogllleee')
b = set('Taobao Gou')

print(a)
print(a - b)     # a 和 b 的差集
print(a | b)     # a 和 b 的并集
print(a & b)     # a 和 b 的交集
print(a ^ b)     # a 和 b 中不同时存在的元素
"""
{'e', 'l', 'g', 'G', 'o'}
{'e', 'l', 'g'}
{'e', 'a', 'u', 'l', 'g', 'G', 'b', 'T', ' ', 'o'}
{'G', 'o'}
{'e', 'l', 'g', 'a', 'u', 'b', 'T', ' '}
"""

print('---------------------------------------------------------------------------------------------------------------')
